scripts/OrderCreate-JMeter-Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.8" jmeter="2.13 r1665067">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="App Shah Desktop Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Order Create REST Service JMeter Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1367432020000</longProp>
        <longProp name="ThreadGroup.end_time">1367432020000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">Mozilla/4.0 (compatible; MSIE 5.5; Windows 98)</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[{&quot;order_type&quot;:&quot;N&quot;,&quot;bulk_id&quot;:66625,&quot;bulk_qty&quot;:1000,&quot;staging&quot;:false,&quot;shipper_id&quot;:134,&quot;allow_prefixless&quot;:false,&quot;shipper_type&quot;:&quot;N&quot;,&quot;shipper_prefix&quot;:&quot;SHAUN&quot;,&quot;customer_ref_no&quot;:1,&quot;instruction&quot;:null,&quot;pickup_weekend&quot;:true,&quot;delivery_weekend&quot;:true,&quot;max_delivery_days&quot;:1,&quot;pickup_date&quot;:&quot;2016-05-18&quot;,&quot;pickup_timewindow_id&quot;:2,&quot;delivery_date&quot;:&quot;2016-05-19&quot;,&quot;delivery_timewindow_id&quot;:-1,&quot;pickup_reach_by&quot;:null,&quot;delivery_reach_by&quot;:null,&quot;source_id&quot;:2,&quot;bulk_sequence_number&quot;:12,&quot;from_waypoint_id&quot;:822402,&quot;to_waypoint_id&quot;:null,&quot;from_international&quot;:false,&quot;to_international&quot;:false,&quot;goods_amount&quot;:null,&quot;shipping_amount&quot;:null,&quot;parcels&quot;:[{&quot;parcel_size&quot;:0,&quot;weight&quot;:1,&quot;volume&quot;:1,&quot;customs_detail&quot;:null,&quot;customs_description&quot;:false,&quot;dimensions&quot;:null,&quot;goods_value&quot;:null,&quot;goods_description&quot;:null}],&quot;from_postcode&quot;:&quot;70000&quot;,&quot;to_postcode&quot;:&quot;018965&quot;,&quot;from_city&quot;:&quot;Ho Chi Minh&quot;,&quot;to_city&quot;:&quot;VN&quot;,&quot;from_country&quot;:&quot;VN&quot;,&quot;to_country&quot;:&quot;VN&quot;,&quot;from_state&quot;:&quot;&quot;,&quot;to_state&quot;:&quot;VN&quot;,&quot;from_address1&quot;:&quot;38 Ch\u1ebf Lan Vi\u00ean, T\u00e2y Th\u1ea1nh, T\u00e2n Ph\u00fa, H\u1ed3 Ch\u00ed Minh, Vietnam&quot;,&quot;to_address1&quot;:&quot;3 CENTRAL BOULEVARD #10-04 MARINA BAY SUITES #10-04 MARINA BAY SUITES&quot;,&quot;from_address2&quot;:&quot;4-6 alley 38-00&quot;,&quot;to_address2&quot;:&quot;&quot;,&quot;from_name&quot;:&quot;Shaun&quot;,&quot;to_name&quot;:&quot;Lisa Tedja&quot;,&quot;from_contact&quot;:&quot;99881122&quot;,&quot;to_contact&quot;:&quot;86152189&quot;,&quot;from_email&quot;:&quot;shaun@ninjavan.co&quot;,&quot;to_email&quot;:&quot;support@ninjavan.sg&quot;,&quot;from_latitude&quot;:14.7067556,&quot;from_longitude&quot;:107.6895654,&quot;to_latitude&quot;:10.755083,&quot;to_longitude&quot;:106.703755,&quot;to_jaroscore&quot;:0.018518518518519}]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api-staging.ninjavan.sg</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/2.0/shippers/bulkorders</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/Users/inesh/iwork/OrderCreateReport.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>